// 有数目不限的1分，2分，5分的硬币，现要凑齐1元钱，有多少种凑法
// 1.暴力破解
// let r = 0
// for (let x = 0; x <= 100; x++) {
//   for (let y = 0; y <= 50; y++) {
//     for (let z = 0; z <= 20; z++) {
//       if (x + 2 * y + 5 * z === 100) {
//         ++r
//       }
//     }
//   }
// }

// 2.优化暴力破解
// let r = 0
// for (let y = 0; y <= 50; y++) {
//   for (let z = 0; z <= (100 - y * 2) / 5; z++) {
//     ++r
//   }
// }

// 3.继续优化暴力破解
// let r = 0
// for (let y = 0; y <= 50; y++) {
//   r += Math.floor((100 - y * 2) / 5) + 1
// }

// console.log(r)
